{"id":196,"title":"Hidden Markov Dirichlet process: modeling genetic inference in open ancestral space","url":"https://www.researchgate.net/publication/250303330_Hidden_Markov_Dirichlet_process_modeling_genetic_inference_in_open_ancestral_space","abstraction":"<p itemprop=\"description\"> <strong>ABSTRACT</strong> </p>\n<div>\n The problem of inferring the population structure, linkage disequilibrium pattern, and\n <br> chromosomal recombination hotspots from genetic polymorphism data is essential for\n <br> understanding the origin and characteristics of genome variations, with important\n <br> applications to the genetic analysis of disease propensities and other complex traits.\n <br> Statistical genetic methodologies developed so far mostly address these problems\n <br> separately using specialized models ranging from coalescence and admixture models for\n <br> population structures, to hidden Markov models and renewal processes for recombination;\n <br> but most of these approaches ignore the inherent uncertainty in the genetic complexity\n <br> (e.g., the number of genetic founders of a population) of the data and the close\n <br> statistical and biological relationships among objects studied in these problems. We\n <br> present a new statistical framework called hidden Markov Dirichlet process (HMDP) to\n <br> jointly model the genetic recombinations among a possibly infinite number of founders and\n <br> the coalescence-with-mutation events in the resulting genealogies. The HMDP posits that a\n <br> haplotype of genetic markers is generated by a sequence of recombination events that\n <br> select an ancestor for each locus from an unbounded set of founders according to a\n <br> 1st-order Markov transition process. Conjoining this process with a mutation model, our\n <br> method accommodates both between-lineage recombination and within-lineage sequence\n <br> variations, and leads to a compact and natural interpretation of the population structure \n <br> and inheritance process underlying haplotype data. We have developed an efficient sampling\n <br> algorithm for HMDP based on a two-level nested Pólya urn scheme, and we present\n <br> experimental results on joint inference of population structure, linkage disequilibrium,\n <br> and recombination hotspots based on HMDP. On both simulated and real SNP haplotype data,\n <br> our method performs competitively or significantly better than extant methods in\n <br> uncovering the recombination hotspots along chromosomal loci; and in addition it also\n <br> infers the ancestral genetic patterns and offers a highly accurate map of ancestral\n <br> compositions of modern populations.\n</div> \n<p></p>"}