{"id":373,"title":"Spectral MLE: Top-$K$ Rank Aggregation from Pairwise Comparisons","url":"https://www.researchgate.net/publication/275669988_Spectral_MLE_Top-K_Rank_Aggregation_from_Pairwise_Comparisons","abstraction":"<p itemprop=\"description\"> <strong>ABSTRACT</strong> </p>\n<div>\n This paper explores the preference-based top-$K$ rank aggregation problem.\n <br> Suppose that a collection of items is repeatedly compared in pairs, and one\n <br> wishes to recover a consistent ordering that emphasizes the top-$K$ ranked\n <br> items, based on partially revealed preferences. We focus on the\n <br> Bradley-Terry-Luce (BTL) model that postulates a set of latent preference\n <br> scores underlying all items, where the odds of paired comparisons depend only\n <br> on the relative scores of the items involved.\n <br> We characterize the minimax limits on identifiability of top-$K$ ranked\n <br> items, in the presence of random and non-adaptive sampling. Our results\n <br> highlight a separation measure that quantifies the gap of preference scores\n <br> between the $K^{\\text{th}}$ and $(K+1)^{\\text{th}}$ ranked items. The minimum\n <br> sample complexity required for reliable top-$K$ ranking scales inversely with\n <br> the separation measure irrespective of other preference distribution metrics.\n <br> To approach this minimax limit, we propose a nearly linear-time ranking scheme,\n <br> called \\emph{Spectral MLE}, that returns the indices of the top-$K$ items in\n <br> accordance to a careful score estimate. In a nutshell, Spectral MLE starts with\n <br> an initial score estimate with minimal squared loss (obtained via a spectral\n <br> method), and then successively refines each component with the assistance of\n <br> coordinate-wise MLEs. Encouragingly, Spectral MLE allows perfect top-$K$ item\n <br> identification under minimal sample complexity. The practical applicability of\n <br> Spectral MLE is further corroborated by numerical experiments.\n</div> \n<p></p>"}