{"id":481,"title":"Dependent Indian Buffet Process-based Sparse Nonparametric Nonnegative Matrix Factorization","url":"https://www.researchgate.net/publication/280062180_Dependent_Indian_Buffet_Process-based_Sparse_Nonparametric_Nonnegative_Matrix_Factorization","abstraction":"<p itemprop=\"description\"> <strong>ABSTRACT</strong> </p>\n<div>\n Nonnegative Matrix Factorization (NMF) aims to factorize a matrix into two\n <br> optimized nonnegative matrices appropriate for the intended applications. The\n <br> method has been widely used for unsupervised learning tasks, including\n <br> recommender systems (rating matrix of users by items) and document clustering\n <br> (weighting matrix of papers by keywords). However, traditional NMF methods\n <br> typically assume the number of latent factors (i.e., dimensionality of the\n <br> loading matrices) to be fixed. This assumption makes them inflexible for many\n <br> applications. In this paper, we propose a nonparametric NMF framework to\n <br> mitigate this issue by using dependent Indian Buffet Processes (dIBP). In a\n <br> nutshell, we apply a correlation function for the generation of two stick\n <br> weights associated with each pair of columns of loading matrices, while still\n <br> maintaining their respective marginal distribution specified by IBP. As a\n <br> consequence, the generation of two loading matrices will be column-wise\n <br> (indirectly) correlated. Under this same framework, two classes of correlation\n <br> function are proposed (1) using Bivariate beta distribution and (2) using\n <br> Copula function. Both methods allow us to adopt our work for various\n <br> applications by flexibly choosing an appropriate parameter settings. Compared\n <br> with the other state-of-the art approaches in this area, such as using Gaussian\n <br> Process (GP)-based dIBP, our work is seen to be much more flexible in terms of\n <br> allowing the two corresponding binary matrix columns to have greater variations\n <br> in their non-zero entries. Our experiments on the real-world and synthetic\n <br> datasets show that three proposed models perform well on the document\n <br> clustering task comparing standard NMF without predefining the dimension for\n <br> the factor matrices, and the Bivariate beta distribution-based and Copula-based\n <br> models have better flexibility than the GP-based model.\n</div> \n<p></p>"}