{"id":509,"title":"On the Amount of Dependence in the Prime Factorization of a Uniform Random Integer","url":"https://www.researchgate.net/publication/236627542_On_the_Amount_of_Dependence_in_the_Prime_Factorization_of_a_Uniform_Random_Integer","abstraction":"<p itemprop=\"description\"> <strong>ABSTRACT</strong> </p>\n<div>\n How much dependence is there in the prime factorization of a random integer\n <br> distributed uniformly from 1 to n? How much dependence is there in the\n <br> decomposition into cycles of a random permutation of n points? What is the\n <br> relation between the Poisson-Dirichlet process and the scale invariant Poisson\n <br> process? These three questions have essentially the same answers, with respect\n <br> to total variation distance, considering only small components, and with\n <br> respect to a Wasserstein distance, considering all components. The Wasserstein\n <br> distance is the expected number of changes -- insertions and deletions --\n <br> needed to change the dependent system into an independent system.\n <br> In particular we show that for primes, roughly speaking, 2+o(1) changes are\n <br> necessary and sufficient to convert a uniformly distributed random integer from\n <br> 1 to n into a random integer prod_{p leq n} p^{Z_p} in which the multiplicity\n <br> Z_p of the factor p is geometrically distributed, with all Z_p independent. The\n <br> changes are, with probability tending to 1, one deletion, together with a\n <br> random number of insertions, having expectation 1+o(1).\n <br> The crucial tool for showing that 2+epsilon suffices is a coupling of the\n <br> infinite independent model of prime multiplicities, with the scale invariant\n <br> Poisson process on (0,infty). A corollary of this construction is the first\n <br> metric bound on the distance to the Poisson-Dirichlet in Billingsley's 1972\n <br> weak convergence result. Our bound takes the form: there are couplings in which\n <br> E sum |log P_i(n) - (log n) V_i | = O(\\log \\log n), where P_i denotes the\n <br> i-th largest prime factor and V_i denotes the i-th component of the\n <br> Poisson-Dirichlet process. It is reasonable to conjecture that O(1) is\n <br> achievable.\n</div> \n<p></p>"}