{"id":603,"title":"Riemannian Manifold Hamiltonian Monte Carlo","url":"https://www.researchgate.net/publication/45860846_Riemannian_Manifold_Hamiltonian_Monte_Carlo","abstraction":"<p itemprop=\"description\"> <strong>ABSTRACT</strong> </p>\n<div>\n The paper proposes a Riemannian Manifold Hamiltonian Monte Carlo sampler to\n <br> resolve the shortcomings of existing Monte Carlo algorithms when sampling from\n <br> target densities that may be high dimensional and exhibit strong correlations.\n <br> The method provides a fully automated adaptation mechanism that circumvents the\n <br> costly pilot runs required to tune proposal densities for Metropolis-Hastings\n <br> or indeed Hybrid Monte Carlo and Metropolis Adjusted Langevin Algorithms. This\n <br> allows for highly efficient sampling even in very high dimensions where\n <br> different scalings may be required for the transient and stationary phases of\n <br> the Markov chain. The proposed method exploits the Riemannian structure of the\n <br> parameter space of statistical models and thus automatically adapts to the\n <br> local manifold structure at each step based on the metric tensor. A\n <br> semi-explicit second order symplectic integrator for non-separable Hamiltonians\n <br> is derived for simulating paths across this manifold which provides highly\n <br> efficient convergence and exploration of the target density. The performance of\n <br> the Riemannian Manifold Hamiltonian Monte Carlo method is assessed by\n <br> performing posterior inference on logistic regression models, log-Gaussian Cox\n <br> point processes, stochastic volatility models, and Bayesian estimation of\n <br> parameter posteriors of dynamical systems described by nonlinear differential\n <br> equations. Substantial improvements in the time normalised Effective Sample\n <br> Size are reported when compared to alternative sampling approaches. Matlab code\n <br> at \\url{http://www.dcs.gla.ac.uk/inference/rmhmc} allows replication of all\n <br> results.\n</div> \n<p></p>"}