{"id":749,"title":"Polynomial-Chaos-based Kriging","url":"https://www.researchgate.net/publication/272359280_Polynomial-Chaos-based_Kriging","abstraction":"<p itemprop=\"description\"> <strong>ABSTRACT</strong> </p>\n<div>\n Computer simulation has become the standard tool in many engineering fields\n <br> for designing and optimizing systems, as well as for assessing their\n <br> reliability. To cope with demanding analysis such as optimization and\n <br> reliability, surrogate models (a.k.a meta-models) have been increasingly\n <br> investigated in the last decade. Polynomial Chaos Expansions (PCE) and Kriging\n <br> are two popular non-intrusive meta-modelling techniques. PCE surrogates the\n <br> computational model with a series of orthonormal polynomials in the input\n <br> variables where polynomials are chosen in coherency with the probability\n <br> distributions of those input variables. On the other hand, Kriging assumes that\n <br> the computer model behaves as a realization of a Gaussian random process whose\n <br> parameters are estimated from the available computer runs, i.e. input vectors\n <br> and response values. These two techniques have been developed more or less in\n <br> parallel so far with little interaction between the researchers in the two\n <br> fields. In this paper, PC-Kriging is derived as a new non-intrusive\n <br> meta-modeling approach combining PCE and Kriging. A sparse set of orthonormal\n <br> polynomials (PCE) approximates the global behavior of the computational model\n <br> whereas Kriging manages the local variability of the model output. An adaptive\n <br> algorithm similar to the least angle regression algorithm determines the\n <br> optimal sparse set of polynomials. PC-Kriging is validated on various benchmark\n <br> analytical functions which are easy to sample for reference results. From the\n <br> numerical investigations it is concluded that PC-Kriging performs better than\n <br> or at least as good as the two distinct meta-modeling techniques. A larger gain\n <br> in accuracy is obtained when the experimental design has a limited size, which\n <br> is an asset when dealing with demanding computational models.\n</div> \n<p></p>"}