{"id":758,"title":"Portfolio theory as a management tool to guide conservation and restoration of multi-stock fish populations","url":"https://www.researchgate.net/publication/287975036_Portfolio_theory_as_a_management_tool_to_guide_conservation_and_restoration_of_multi-stock_fish_populations","abstraction":"<p itemprop=\"description\"> <strong>ABSTRACT</strong> </p>\n<div>\n Habitat degradation and harvest have upset the natural buffering mechanism (i.e., portfolio\n <br> effects) of many large-scale multi-stock fisheries by reducing spawning stock diversity that is vital for\n <br> generating population stability and resilience. The application of portfolio theory offers a means to guide\n <br> management activities by quantifying the importance of multi-stock dynamics and suggesting\n <br> conservation and restoration strategies to improve naturally occurring portfolio effects. Our application\n <br> of portfolio theory to Lake Erie Sander vitreus (walleye), a large population that is supported by riverine\n <br> and open-lake reef spawning stocks, has shown that portfolio effects generated by annual inter-stock larval\n <br> fish production are currently suboptimal when compared to potential buffering capacity. Reduced\n <br> production from riverine stocks has resulted in a single open-lake reef stock dominating larval production,\n <br> and in turn, high inter-annual recruitment variability during recent years. Our analyses have shown (1) a\n <br> weak average correlation between annual river and reef larval production ( ¯q ¼ 0.24), suggesting that a\n <br> natural buffering capacity exists in the population, and (2) expanded annual production of larvae (potential\n <br> recruits) from riverine stocks could stabilize the fishery by dampening inter-annual recruitment variation.\n <br> Ultimately, our results demonstrate how portfolio theory can be used to quantify the importance of\n <br> spawning stock diversity and guide management on ecologically relevant scales (i.e., spawning stocks)\n <br> leading to greater stability and resilience of multi-stock populations and fisheries.\n</div> \n<p></p>"}