{"id":774,"title":"Computing transition rates for the 1-D stochastic Ginzburg--Landau--Allen--Cahn equation for finite-amplitude noise with a rare event algorithm","url":"https://www.researchgate.net/publication/280243098_Computing_transition_rates_for_the_1-D_stochastic_Ginzburg--Landau--Allen--Cahn_equation_for_finite-amplitude_noise_with_a_rare_event_algorithm","abstraction":"<p itemprop=\"description\"> <strong>ABSTRACT</strong> </p>\n<div>\n In this paper we compute and analyse the transition rates and duration of\n <br> reactive trajectories of the stochastic 1-D Allen-Cahn equations for both the\n <br> Freidlin-Wentzell regime (weak noise or temperature limit) and finite-amplitude\n <br> white noise, as well as for small and large domain. We demonstrate that\n <br> extremely rare reactive trajectories corresponding to direct transitions\n <br> between two metastable states are efficiently computed using an algorithm\n <br> called adaptive multilevel splitting. This algorithm is dedicated to the\n <br> computation of rare events and is able to provide ensembles of reactive\n <br> trajectories in a very efficient way. In the small noise limit, our numerical\n <br> results are in agreement with large-deviation predictions such as\n <br> instanton-like solutions, mean first passages and escape probabilities. We show\n <br> that the duration of reactive trajectories follows a Gumbel distribution like\n <br> for one degree of freedom systems. Moreover, the mean duration growths\n <br> logarithmically with the inverse temperature. The prefactor given by the\n <br> potential curvature grows exponentially with size. The main novelty of our work\n <br> is that we also perform an analysis of reactive trajectories for large noises\n <br> and large domains. In this case, we show that the position of the reactive\n <br> front is essentially a random walk. This time, the mean duration grows linearly\n <br> with the inverse temperature and quadratically with the size. Using a\n <br> phenomenological description of the system, we are able to calculate the\n <br> transition rate, although the dynamics is described by neither\n <br> Freidlin--Wentzell or Eyring--Kramers type of results. Numerical results\n <br> confirm our analysis.\n</div> \n<p></p>"}