{"id":909,"title":"Bayesian benchmarking with applications to small area estimation","url":"https://www.researchgate.net/publication/227317297_Bayesian_benchmarking_with_applications_to_small_area_estimation","abstraction":"It is well-known that small area estimation needs explicit or at least implicit use of models (cf. Rao in Small Area Estimation, Wiley, New York, 2003). These model-based estimates can differ widely from the direct estimates, especially for areas with very low sample sizes. While model-based small area estimates are very useful, one potential difficulty with such estimates is that when aggregated, the overall estimate for a larger geographical area may be quite different from the corresponding direct estimate, the latter being usually believed to be quite reliable. This is because the original survey was designed to achieve specified inferential accuracy at this higher level of aggregation. The problem can be more severe in the event of model failure as often there is no real check for validity of the assumed model. Moreover, an overall agreement with the direct estimates at an aggregate level may sometimes be politically necessary to convince the legislators of the utility of small area estimates.  One way to avoid this problem is the so-called “benchmarking approach”, which amounts to modifying these model-based estimates so that we get the same aggregate estimate for the larger geographical area. Currently, the most popular approach is the so-called “raking” or ratio adjustment method, which involves multiplying all the small area estimates by a constant data-dependent factor so that the weighted total agrees with the direct estimate. There are alternate proposals, mostly from frequentist considerations, which meet also the aforementioned benchmarking criterion.  We propose in this paper a general class of constrained Bayes estimators which also achieve the necessary benchmarking. Many of the frequentist estimators, including some of the raked estimators, follow as special cases of our general result. Explicit Bayes estimators are derived which benchmark the weighted mean or both the weighted mean and weighted variability. We illustrate our methodology by developing poverty rates in school-aged children at the state level and then benchmarking these estimates to match at the national level. Unlike the existing frequentist benchmarking literature, which is primarily based on linear models, the proposed Bayesian approach can accommodate any arbitrary model, and the benchmarked Bayes estimators are based only on the posterior mean and the posterior variance-covariance matrix.  KeywordsArea-level–Penalty parameter–Two-stage–Weighted mean–Weighted variability"}