{"id":963,"title":"The link between perception of clinical empathy and nonverbal behavior: The effect of a doctor's gaze and body orientation","url":"https://www.researchgate.net/publication/281092615_The_link_between_perception_of_clinical_empathy_and_nonverbal_behavior_The_effect_of_a_doctor%27s_gaze_and_body_orientation","abstraction":"Clinical empathy is considered to be one of the most important skills for medical professionals. It is primarily conveyed by nonverbal behavior; however, little is known about the importance of different types of cues and their relation to engagement and sincerity as possible correlates of perceived clinical empathy (PCE). In this study, we explored the effect of doctor's gaze and body orientation on PCE with the help of 32 video vignettes. Actors impersonating medical interns displayed different combinations of gaze and body orientation while uttering an empathetic verbal statement. The video vignettes were evaluated in terms of the perceived clinical and general empathy, engagement and sincerity. A principal component analysis revealed a possible single-factor solution for the scales measuring the two types of empathy, engagement and sincerity; therefore, they were subsumed under general perceived empathy (GPE). An analysis of variance showed a main effect of gaze and body orientation, with a stronger effect of gaze, on GPE. We subsequently performed a linear random effects analysis, which indicated possible gender-related differences in the perception of gaze. The outcomes of our experiment confirm that both gaze and body orientation have an influence on the GPE. The effect of gaze, however, appears to be gender-dependent: in the experiment, males were perceived as slightly more empathetic with patient-centered gaze, while for females averted gaze resulted in higher GPE scores. The findings are directly relevant in the context of medical communication training. Perception of clinical empathy supports medical information transfer, diagnosis quality and other patient outcomes. Copyright © 2015 Elsevier Ireland Ltd. All rights reserved."}